; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v12 ?v1)
             (pred_10 ?v8 ?v2)
             (pred_4 ?v12 ?v2)
             (pred_12 ?v3 ?v12 )
	     (pred_8 ?v12)
             (pred_9 ?v13)
             (pred_3 ?v8)
             (pred_7 ?v2)
             (pred_11 ?v12)
             (pred_5 ?v8)
             (pred_6 ?v12)
             (pred_2 ))



(:action op_5
:parameters (?v10 ?v5 ?v6 ?v9)
:precondition (and (pred_9 ?v10) (pred_9 ?v5) (pred_3 ?v6) (pred_7 ?v9)
          (pred_1 ?v10 ?v5) (pred_10 ?v6 ?v9)
                   (pred_4 ?v5 ?v9) (pred_8 ?v10) 
                   (pred_11 ?v5) (pred_5 ?v6))
:effect (and  (pred_6 ?v5) (not (pred_11 ?v5))))


(:action op_2
:parameters (?v10 ?v7)
:precondition (and (pred_9 ?v10) (pred_9 ?v7)
               (pred_8 ?v10) (pred_1 ?v10 ?v7) (pred_6 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v10))))

(:action op_1
:parameters (?v10 ?v6)
:precondition (and (pred_9 ?v10) (pred_3 ?v6) 
                  (pred_8 ?v10) (pred_12 ?v6 ?v10) (pred_2 ))
:effect (and (pred_5 ?v6)
   (not (pred_12 ?v6 ?v10)) (not (pred_2 ))))


(:action op_3
:parameters (?v10 ?v4 ?v11)
:precondition (and (pred_9 ?v10) (pred_3 ?v4) (pred_3 ?v11)
                  (pred_8 ?v10) (pred_5 ?v11) (pred_12 ?v4 ?v10))
:effect (and (pred_5 ?v4) (pred_12 ?v11 ?v10)
        (not (pred_5 ?v11)) (not (pred_12 ?v4 ?v10))))

(:action op_4
:parameters (?v10 ?v6)
:precondition (and (pred_9 ?v10) (pred_3 ?v6) 
                  (pred_8 ?v10) (pred_5 ?v6))
:effect (and (pred_2 ) (pred_12 ?v6 ?v10) (not (pred_5 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_09 obj_18 obj_17 obj_20 obj_01 obj_02 obj_10 obj_16 obj_11 obj_03 obj_08 obj_13 obj_05 obj_19 obj_14 obj_06
    obj_12 obj_04
    obj_15 obj_07
    )

    (:init
       (pred_2)

       (pred_9 obj_09)
       (pred_9 obj_18)
       (pred_9 obj_17)
       (pred_9 obj_20)
       (pred_9 obj_01)
       (pred_9 obj_02)
       (pred_9 obj_10)
       (pred_9 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_03)
       (pred_9 obj_08)
       (pred_9 obj_13)
       (pred_9 obj_05)
       (pred_9 obj_19)
       (pred_9 obj_14)
       (pred_9 obj_06)
       (pred_7 obj_12)
       (pred_7 obj_04)
       (pred_3 obj_15)
       (pred_3 obj_07)

       (pred_1 obj_09 obj_01)
       (pred_1 obj_09 obj_18)
       (pred_1 obj_18 obj_02)
       (pred_1 obj_18 obj_17)
       (pred_1 obj_18 obj_09)
       (pred_1 obj_17 obj_10)
       (pred_1 obj_17 obj_20)
       (pred_1 obj_17 obj_18)
       (pred_1 obj_20 obj_16)
       (pred_1 obj_20 obj_17)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_01 obj_02)
       (pred_1 obj_01 obj_09)
       (pred_1 obj_02 obj_03)
       (pred_1 obj_02 obj_10)
       (pred_1 obj_02 obj_18)
       (pred_1 obj_02 obj_01)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_16)
       (pred_1 obj_10 obj_17)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_16 obj_13)
       (pred_1 obj_16 obj_20)
       (pred_1 obj_16 obj_10)
       (pred_1 obj_11 obj_05)
       (pred_1 obj_11 obj_03)
       (pred_1 obj_11 obj_01)
       (pred_1 obj_03 obj_19)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_02)
       (pred_1 obj_03 obj_11)
       (pred_1 obj_08 obj_14)
       (pred_1 obj_08 obj_13)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_13 obj_16)
       (pred_1 obj_13 obj_08)
       (pred_1 obj_05 obj_19)
       (pred_1 obj_05 obj_11)
       (pred_1 obj_19 obj_14)
       (pred_1 obj_19 obj_03)
       (pred_1 obj_19 obj_05)
       (pred_1 obj_14 obj_06)
       (pred_1 obj_14 obj_08)
       (pred_1 obj_14 obj_19)
       (pred_1 obj_06 obj_13)
       (pred_1 obj_06 obj_14)
       (pred_11 obj_17)
       (pred_11 obj_18)
       (pred_4  obj_17 obj_12)
       (pred_4  obj_18 obj_04)
       (pred_6 obj_09)
       (pred_6 obj_20)
       (pred_6 obj_01)
       (pred_6 obj_02)
       (pred_6 obj_10)
       (pred_6 obj_16)
       (pred_6 obj_11)
       (pred_6 obj_03)
       (pred_6 obj_08)
       (pred_6 obj_13)
       (pred_6 obj_05)
       (pred_6 obj_19)
       (pred_6 obj_14)
       (pred_6 obj_06)

       (pred_10  obj_15 obj_12)
       (pred_10  obj_07 obj_04)
       (pred_12 obj_15 obj_16)
       (pred_12 obj_07 obj_03)
       (pred_8 obj_01)
    )

    (:goal (and
       (pred_12 obj_07 obj_13)
    ))
(:constraints
  (always (not (pred_8 obj_08)))
)
)

; plan
1. (op_2 obj_01 obj_11)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_11)
   goals met: 0 of 1
2. (op_2 obj_11 obj_03)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_03)
   goals met: 0 of 1
3. (op_1 obj_03 obj_07)
   deleted: (pred_12 obj_07 obj_03) (pred_2)
   added: (pred_5 obj_07)
   goals met: 0 of 1
4. (op_2 obj_03 obj_02)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_02)
   goals met: 0 of 1
5. (op_2 obj_02 obj_10)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_10)
   goals met: 0 of 1
6. (op_2 obj_10 obj_16)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_16)
   goals met: 0 of 1
7. (op_2 obj_16 obj_13)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_13)
   goals met: 0 of 1
8. (op_4 obj_13 obj_07)
   deleted: (pred_5 obj_07)
   added: (pred_2) (pred_12 obj_07 obj_13)
   goals met: 1 of 1
